vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32672.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Maxim</vendor>
   <name>MAX32672</name>
   <url>https://www.mxim.net/microcontroller/pack/</url>
   <description>Maxim Integrated MAX32672 Series Device Support, Board Support Package and Examples</description>
   <supportContact>support@maximintegrated.com</supportContact>

   <license>License/END_USER_LICENSE_AGREEMENT.rtf</license>

   <releases>                  <!-- YYYY-MM-DD -->
   
      <release version="1.6.0" date="2022-12-12">
         - Secure Boot Keil implememnted and being released.
      </release>    
      <release version="1.5.0" date="2022-11-14">
        - Libraries updated 
		- secure Keil is under construction.
      </release>   
      <release version="1.4.1" date="2022-07-01">
        - Keil and IAR release.
      </release> 
      <release version="1.4.0" date="2022-06-29">
        - Internal release for Keil only.
      </release> 
      <release version="1.3.0" date="2022-04-15">
        - Added support for Secure part, in Keil IDE 
      </release> 
      <release version="1.2.0-p3" date="2022-02-26">
        - Making an internal Keil release with Version 6 compiler 
      </release>  
      <release version="1.2.0-p2" date="2022-02-24">
        - Making an internal Keil release. 
			- Resolved NVIC_GetVector and SetVctor
			- Added DMA and Flash Example
			- updated the Keil loader
      </release> 
      <release version="1.2.0-p1" date="2022-02-23">
        - Making an internal Keil release.
      </release>
      <release version="1.0.4" date="2021-09-30">
        - Fixed .pdsc file errors for IAR/Keil website release.
      </release>
      <release version="1.0.3" date="2021-07-15">
      	- ECC ON, therefore SRAM is 160K
		- supports SLA is off
		- Supports early samples and final MAX32672
		- Pack file generated using new script from ARM
		- Removed illegitimate file path names and redundant files
      </release> 
      <release version="1.0.2" date="2021-06-03">
      	- Fixed flash and ram size (in .pdsc)
      </release> 
      <release version="1.0.1" date="2021-04-15">
      	- Adding examples ADC, QDEC, Comparator
      </release> 
      <release version="1.0.0" date="2021-03-24">
      	- First Release, merging to MSDK on GIT.  Software merge.
      </release> 
   </releases>

   <keywords>
      <keyword>Maxim</keyword>
      <keyword>MAX32672</keyword>
      <keyword>MAX32672 Evaluation Kit</keyword>
      <keyword>Maxim Device Support</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package Maxim</keyword>
      <keyword>Maxim Evaluation Kit</keyword>
   </keywords>

   <requirements>
      <languages>
         <language name="C" version="99" />
      </languages>
   </requirements>
   
   <devices>
      <family Dfamily="MAX32672 family" Dvendor="Maxim:23">
         <book name="Doc/MAX32672_datasheet.txt" title="MAX32672 Family Data Sheet"/>
         <book name="Doc/MAX32672_userguide.txt" title="MAX32672 Family Users Guide"/>         
         <compile header="Libraries/CMSIS/Device/Maxim/MAX32672/Include/max32672.h" />
         <compile header="Libraries/CMSIS/Device/Maxim/MAX32672/Include/max32672.h" define="MAX32672"/>
         <memory name="IROM1" access="rx" start="0x10000000" size="0x00100000" startup="1" default="1"/>
         <memory name="IRAM1" access="rwx" start="0x20000000" size="0x00032000" init="0" default="1"/>
         <algorithm name="Flash/MAX32672.FLM" start="0x10000000" size="0x00100000" default="1"/>
         <algorithm  name="FlashIAR/FlashMAX32672.flash" start="0x10000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00032000" default="0" style="IAR"/>
         <description>
            The MAX32672 is an ultra-low-power, cost-effective, high reliability 32-bit microcontroller enabling designs
            with complex sensor processing without compromising battery life. It combines a flexible and versatile power management
            unit with the powerful Arm Cortex-M4 core with FPU. It also offers legacy designs an easy and cost optimal upgrade path
            from 8- or 16-bit microcontrollers. Error correction coding (ECC) (single error correction double error detection) for flash,
            and SRAM provides extremely reliable code execution. The device integrates up to 384KB of flash memory and 160KB
            (128KB with ECC) of SRAM to accommodate application and sensor code.
            The device features five powerful and flexible power modes. It can operate from a single-supply battery or a dual-supply
            typically provided by a PMIC. The I2C ports support standard, fast, fast-plus, and high-speed modes, operating up to
            3400kbps. The SPI ports can run up to 48MHz in both master and slave mode, and three UARTs can run up to 4000kbaud.
            One low power UART can run up to 1000kbaud. Four general-purpose 32-bit timers, two low power 32-bit timers, two
            windowed watchdog timers, and a real-time clock are also provided. An I2S interface provides digital audio streaming to a
            codec.
         </description>     
     <!--    <feature type="IOs" n="48"/>
         <feature type="NVIC" n="110" name="NVIC"/>
         <feature type="DMA" n="16" name="DMA"/>
         <feature type="Timer" n="6" m="32" name="Timer Module"/>
         <feature type="WDT" n="3"/>
         <feature type="I2C" n="3" name="I2C"/>
         <feature type="SPI" n="3" m="50000000" name="QSPI"/>
         <feature type="UART" n="3" m="3000000" name="High-Speed UART Interface"/>
         <feature type="USBD" n="1" name="High-Speed USB Device"/> -->
         <!--<debug svd="SVD/MAX32672/max32672.svd" /> DELETE -->
		 <debug svd="Libraries/CMSIS/Device/Maxim/MAX32672/Include/max32672.svd" version="1.6.0" />

         <debugport __dp="0">
            <swd idcode="0x2BA01477" />
         </debugport>

         <device Dname="MAX32672">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Pname="Cortex-M4" Punits="2" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
         </device>
