vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32672.pdsc
<!--		 
         <device Dname="MAX32676">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Pname="Cortex-M4" Punits="2" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
            <feature type="Crypto" n="128.256" name="HW Accelerated Trust Protection Unit"/>
         </device>		
-->		 
      </family>
   </devices>

   <!-- MAX32672 Evaluation Kit Board Support Package -->
   <boards>
      <board vendor="Maxim" name="MAX32672 EvKit" salesContact="sales@maximintegrated.com">
         <description>The MAX32672 Evaluation Kit provides a convenient platform for evaluating the capabilities of the MAX32672 Family of microcontrollers. The Evaluation Kit also provides a complete, functional system ideal for developing and debugging applications.
         </description>
         <book category="overview" name="Doc/MAX32672_EvKit.txt" title="MAX32672 EvKit Datasheet"/>
         <book category="schematic" name="Doc/MAX32672_EvKitSchematic.txt" title="MAX32672 EvKit Schematic"/>
    <!--     <feature type="PWR" n="5" name="USB Powered"/>
         <feature type="MemCard" n="1" name="SD Card Holder"/>
         <feature type="RAM" n="1" name="128kB SPIXR RAM"/>
         <feature type="ROM" n="1" name="8 MB SPIXF NOR-Flash"/>
         <feature type="USB" n="1" name="High-Speed USB Device, Micro-B receptacle"/>
         <feature type="Button" n="3" name="Push-buttons: Reset, 2x User"/>
         <feature type="LED" n="2" name="User LEDs"/>
         <feature type="GLCD" n="1" m="128.128" name="1.3 inch SPI LCD"/>
         <feature type="LineIn" n="1" name="TRS Audio Jack"/>
         <feature type="LineOut" n="1" name="TRS Audio Jack"/>
         <feature type="AIO" n="8" name="Analog Inputs"/>
         <feature type="DIO" n="16" name="Digital IOs"/> -->
 <!--        <mountedDevice Dvendor="Maxim:23" Dname="MAX32676"/> -->
		 <mountedDevice Dvendor="Maxim:23" Dname="MAX32672"/>
         <debugInterface adapter="CMSIS-DAP" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
         <debugInterface adapter="JTAG/SW" connector="20-pin Arm Standard JTAG Connector"/>
      </board>
   </boards>
  
   <!-- Evaluation Kit Example Programs -->

      
   <examples>
   
      <example name="ADC" doc="ARM/Abstract.txt" folder="Examples/MAX32672/ADC">
         <description>ADC Demo</description>
         <board name="MAX32672 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/ADC.ewp" />
            <environment name="uv" load="ARM/ADC.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32672 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="MAX32672 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>      
  
      <example name="AES" doc="ARM/Abstract.txt" folder="Examples/MAX32672/AES">
         <description>AES Demo</description>
         <board name="MAX32672 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/AES.ewp" />
            <environment name="uv" load="ARM/AES.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32672 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="MAX32672 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>    

      <example name="Comparator" doc="ARM/Abstract.txt" folder="Examples/MAX32672/Comparator">
         <description>Comparator Demo</description>
         <board name="MAX32672 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Comparator.ewp" />
            <environment name="uv" load="ARM/Comparator.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32672 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="MAX32672 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

	  
      <example name="CRC" doc="ARM/Abstract.txt" folder="Examples/MAX32672/CRC">
         <description>CRC Module Demo</description>
         <board name="MAX32672 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/CRC.ewp" />
            <environment name="uv" load="ARM/CRC.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32672 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="CRC"/>
            <component Cbundle="MAX32672 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  
	  
      <example name="DMA" doc="ARM/Abstract.txt" folder="Examples/MAX32672/DMA">
         <description>Direct Memory Access Controller Demo</description>
         <board name="MAX32672 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/DMA.ewp" />
            <environment name="uv" load="ARM/DMA.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32672 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="DMA"/>
            <component Cbundle="MAX32672 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>  
 
