vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32672.pdsc
      <example name="SPI" doc="ARM/Abstract.txt" folder="Examples/MAX32672/SPI">
         <description>SPI Demo</description>
         <board name="MAX32672 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/SPI.ewp" />
            <environment name="uv" load="ARM/SPI.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32672 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>          
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="SPI"/>
            <component Cbundle="MAX32672 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>      
      </example>
	  
      <example name="TMR" doc="ARM/Abstract.txt" folder="Examples/MAX32672/TMR">
         <description>Timer Demo</description>
         <board name="MAX32672 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/TMR.ewp" />
            <environment name="uv" load="ARM/TMR.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32672 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32672 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="TRNG" doc="ARM/Abstract.txt" folder="Examples/MAX32672/TRNG">
         <description>True Random Num Gen</description>
         <board name="MAX32672 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/TRNG.ewp" />
            <environment name="uv" load="ARM/TRNG.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32672 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="TRNG"/>
            <component Cbundle="MAX32672 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>           

      <example name="UART" doc="ARM/Abstract.txt" folder="Examples/MAX32672/UART">
         <description>UART Demo</description>
         <board name="MAX32672 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/UART.ewp" />
            <environment name="uv" load="ARM/UART.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32672 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="UART"/>
            <component Cbundle="MAX32672 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 

      <example name="Watchdog" doc="ARM/Abstract.txt" folder="Examples/MAX32672/Watchdog">
         <description>Watchdog Demo</description>
         <board name="MAX32672 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Watchdog.ewp" />
            <environment name="uv" load="ARM/Watchdog.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32672 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="WDT"/>
            <component Cbundle="MAX32672 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 
	  
   </examples>
   


   <conditions>
      <!-- MAX32672 Device Condition -->
      <condition id="MAX32672 Family">
         <description> Maxim Integrated MAX32672 device family</description>
         <require Dvendor="Maxim:23"/>
		 <require Dname="MAX32672"/>
         <!-- <require Dfamily="MAX32672"/> -->
      </condition>

      <!-- MAX32672 Device Condition -->
      <condition id="MAX32672 Device">
         <description> Maxim Integrated MAX32672 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32672"/>
      </condition>


      <!-- MAX32676 Device Condition -->
<!--      <condition id="MAX32676 Device">
         <description> Maxim Integrated MAX32672 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32676"/>
      </condition> -->

      <!-- MAX32672/51/52 CMSIS-CORE Condition -->
      <condition id="MAX32672 CMSIS-CORE">
         <description>Maxim MAX32672 Series devices and CMSIS-CORE</description>
         <require Cclass="CMSIS" Cgroup="CORE"/>
         <require condition="MAX32672 Family"/>
     <!--    <accept condition="MAX32676 Device"/> -->
		 <accept condition="MAX32672 Device"/>
         <require Cclass="Device" Cgroup="Startup"/>
      </condition>

      <!-- GNUC/Eclipse Compiler Condition -->
      <condition id="Startup GCC">
         <description>Startup files for the GNU C Toolchain</description>
         <require Tcompiler="GCC"/>
      </condition>

      <!-- IAR Embedded Workbench Compiler Condition -->
      <condition id="Startup ARM">
         <description>Startup files for the KEIL Embedded Workbench Toolchain</description>
         <require Tcompiler="ARMCC"/>
      </condition> 
      <condition id="Startup IAR">
         <description>Startup files for the IAR Embedded Workbench Toolchain</description>
         <require Tcompiler="IAR"/>
      </condition>


      <!-- ADC Peripheral Condition -->
      <condition id="MAX32672 CMSIS ADC">
         <description>ADC Interface</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>

      <!-- AES Peripheral Condition -->
      <condition id="MAX32672 CMSIS AES">
         <description>AES Interface</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>
	  
      <!-- CRC Peripheral Condition -->
      <condition id="MAX32672 CMSIS CRC">
         <description>CRC</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>	
	
      <!-- AFE Peripheral Condition -->
      <condition id="MAX32672 CMSIS AFE">
         <description>AFE</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>	
	
      <!-- CTB Peripheral Condition -->
      <condition id="MAX32672 CMSIS CTB">
         <description>CTB</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>		
	
      <!-- Standard DMA Peripheral -->
      <condition id="MAX32672 CMSIS DMA">
         <description>Standard DMA</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>	  

      <!-- FLash Controller Peripheral -->
      <condition id="MAX32672 CMSIS FLC">
         <description>Internal Flash Controller</description>
         <require condition="MAX32672 CMSIS-CORE"/>
         <require condition="MAX32672 CMSIS ICC"/>
      </condition>

