vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32672.pdsc
      <!-- GPIO -->
      <condition id="MAX32672 CMSIS GPIO">
         <description>GPIO</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>

      <!-- I2C -->
      <condition id="MAX32672 CMSIS I2C">
         <description>I2C Interface</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>

      <!-- I2S -->
      <condition id="MAX32672 CMSIS I2S">
         <description>I2S Interface</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>

      <!-- ICC -->
      <condition id="MAX32672 CMSIS ICC">
         <description>Instruction Cache Controller</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>

      <!-- Low Power -->
      <condition id="MAX32672 CMSIS Low Power">
         <description>Low Power API</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>

      <!-- QDEC -->
      <condition id="MAX32672 CMSIS QDEC">
         <description>QDEC Interface</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>

      <!-- RTC -->
      <condition id="MAX32672 CMSIS RTC">
         <description>Real-Time Clock</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>

      <!-- SPI Peripheral -->
      <condition id="MAX32672 CMSIS SPI">
         <description>SPI Interface</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>

      <!-- SYS -->
      <condition id="MAX32672 CMSIS SYS">
         <description>SYS Interface</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>

      <!-- Timer -->
      <condition id="MAX32672 CMSIS TIMER">
         <description>Timers</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>

      <!-- TRNG -->
      <condition id="MAX32672 CMSIS TRNG">
         <description>Timers</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>

      <!-- UART -->
      <condition id="MAX32672 CMSIS UART">
         <description>UART</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>

      <!-- WDT -->
      <condition id="MAX32672 CMSIS WDT">
         <description>Watchdog Timers</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition>

      <!-- SIMO -->
 <!--     <condition id="MAX32672 CMSIS SIMO">
         <description>Single Inductor Multiple Output DC/DC Converter</description>
         <require condition="MAX32672 CMSIS-CORE"/>
      </condition> -->

      <condition id="MAX32672 BSP DEP">	  
	     <description>Board Support Package</description>
         <!-- <require condition="MAX32672 CMSIS-CORE"/> -->
         <accept condition="MAX32672 Family"/>
         <require Cclass="Device" Cgroup="UART"/>
         <require Cclass="Device" Cgroup="GPIO"/>
      </condition>
	  
   </conditions>	  

   <components>
                                                                                
  <!--     <component Cgroup="Rev" Cclass="Target Rev" Cvariant="A1" Cversion="1.6.0" versionMatchMode="fixed" condition="MAX32672 Family"> -->
<!--       <component Cgroup="Rev" Cclass="Target Rev" Cvariant="A1" Cversion="1.6.0" condition="MAX32672 Family">
            <description>Target Rev A1 selected</description>
            <RTE_Components_h>
			 #define TARGET 32672   /* Target Device Part Number */
             #define TARGET_REV 0x4131       /* A1 chip */
            </RTE_Components_h>
       </component>

       <component Cgroup="Rev" Cclass="Target Rev" Cvariant="A2" Cversion="1.6.0" condition="MAX32672 Family">
             <description>Target Rev A2 selected</description>
             <RTE_Components_h>
			 #define TARGET 32672   /* Target Device Part Number */
             #define TARGET_REV 0x4132       /* A2 chip */
             </RTE_Components_h>
        </component>
-->
      <bundle Cbundle="Maxim API" Cclass="Device" Cversion="1.6.0">
         <description>Maxim Developed Hardware Abstraction Layer</description>
         <doc>Doc/SDK_Documentation/doxygen.txt</doc>

         <!-- MAX32672 Device Selection -->
         <component Cgroup="Startup" Cversion="1.6.0" condition="MAX32672 Family" >
            <description>System Startup for Maxim MAX32672 Microcontroller</description>
			
			
            <files>
               <!-- Include paths for the tools -->
               <file category="include" name="Libraries/CMSIS/Device/Maxim/MAX32672/Include/" version="1.6.0" />
               <file category="include" name="Libraries/PeriphDrivers/Include/MAX32672/" version="1.6.0" />

			   <file category="include" name="Libraries/PeriphDrivers/Source/ADC/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/AES/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/CRC/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/AFE/" version="1.6.0"/>			   
			   <file category="include" name="Libraries/PeriphDrivers/Source/DMA/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/FLC/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/GPIO/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/I2C/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/I2S/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/ICC/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/LP/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/QDEC/" version="1.6.0"/>			   
			   <file category="include" name="Libraries/PeriphDrivers/Source/RTC/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SPI/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SYS/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/TMR/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/TRNG/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/UART/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/WDT/" version="1.6.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/CTB/" version="1.6.0"/>			   

               <!-- Keil/ARM device startup file and sub_main to call SystemInit -->			   
               <file category="sourceAsm" attr="config" version="1.6.0" name="Libraries/CMSIS/Device/Maxim/MAX32672/Source/ARM/startup_max32672.s" condition="Startup ARM" />
               <file category="sourceC" attr="config"  version="1.6.0" name="Libraries/CMSIS/Device/Maxim/MAX32672/Source/ARM/sub_main.c" condition="Startup ARM" />
			   <file category="sourceC" attr="config"  version="1.6.0" name="Libraries/CMSIS/Device/Maxim/MAX32672/Source/ARM/sla_header.c" condition="Startup ARM" />			   
				
				
               <!-- GNUC/Eclipse device startup file -->
               <file category="sourceAsm" attr="config"  version="1.6.0" name="Libraries/CMSIS/Device/Maxim/MAX32672/Source/GCC/startup_max32672.S" condition="Startup GCC" />

