vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32672.pdsc
               <!-- IAR device startup file, low level init and cmain.s -->  
               <file category="sourceAsm" attr="config" name="Libraries/CMSIS/Device/Maxim/MAX32672/Source/IAR/startup_max32672.s" condition="Startup IAR" version="1.6.0" />
               <file category="sourceC" attr="config"  version="1.6.0" name="Libraries/CMSIS/Device/Maxim/MAX32672/Source/IAR/low_level_init.c" condition="Startup IAR" />
               <file category="sourceAsm" attr="config"  version="1.6.0" name="Libraries/CMSIS/Device/Maxim/MAX32672/Source/IAR/cmain.s" condition="Startup IAR" />
			   <file category="sourceC" attr="config"  version="1.6.0" name="Libraries/CMSIS/Device/Maxim/MAX32672/Source/IAR/sla_header.c" condition="Startup IAR" />

               <!-- System, NVIC and device header files common to all platforms -->
               <file category="sourceC" attr="config"  version="1.6.0" name="Libraries/CMSIS/Device/Maxim/MAX32672/Source/system_max32672.c" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c" version="1.6.0" />
               <file category="header" attr="config" name="Libraries/CMSIS/Device/Maxim/MAX32672/Include/max32672.h" version="1.6.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_assert.c"  version="1.6.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_delay.c"  version="1.6.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_lock.c"  version="1.6.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_me21.c"  version="1.6.0" />
             <!--  <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_me21.c"  version="1.6.0" />	  --> 
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c"  version="1.6.0" />		   
            </files>
         </component>
		 
		  <component Cgroup="ADC" condition="MAX32672 CMSIS ADC" Cversion="1.6.0"> 
         	 <description>ADC Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/ADC/adc_me21.c" version="1.6.0"/>
	           <file category="sourceC" name="Libraries/PeriphDrivers/Source/ADC/adc_revb.c" version="1.6.0"/>			   
            </files>
         </component>

         <component Cgroup="AES" condition="MAX32672 CMSIS AES" Cversion="1.6.0"> 
         	 <description>AES Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/AES/aes_me21.c" version="1.6.0"/>
	           <file category="sourceC" name="Libraries/PeriphDrivers/Source/AES/aes_revb.c" version="1.6.0"/>			   
            </files>
         </component>
		 
		 <component Cgroup="AFE" condition="MAX32672 CMSIS AFE" Cversion="1.6.0"> 
         	 <description>AFE Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/AFE/afe.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/AFE/afe_gpio.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/AFE/infoblock.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/AFE/hart_uart.c" version="1.6.0"/>			   
            </files>
         </component>		 		 
		 
		 <component Cgroup="CRC" condition="MAX32672 CMSIS CRC" Cversion="1.6.0"> 
         	 <description>CRC</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/CRC/crc_me15.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/CRC/crc_reva.c" version="1.6.0"/>
            </files>
         </component>

		 <component Cgroup="CTB" condition="MAX32672 CMSIS CTB" Cversion="1.6.0"> 
         	 <description>CTB</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/CTB/ctb_common.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/CTB/ctb_me21.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/CTB/ctb_reva.c" version="1.6.0"/>		   
            </files>
         </component>		 

         <component Cgroup="DMA" condition="MAX32672 CMSIS DMA" Cversion="1.6.0">
            <description>Standard DMA</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/DMA/dma_me21.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/DMA/dma_reva.c" version="1.6.0"/>
            </files>
         </component>

         <component Cgroup="FLC" condition="MAX32672 CMSIS FLC" Cversion="1.6.0" >
            <description> Flash Controller </description>
            <files>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_me21.c" version="1.6.0"/>			
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_common.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_reva.c" version="1.6.0"/>					   			   
            </files>
         </component>
		 
		 <component Cgroup="GPIO" condition="MAX32672 CMSIS GPIO" Cversion="1.6.0">
            <description> GPIO </description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_me21.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_reva.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_common.c" version="1.6.0"/>		   
            </files>
         </component>
		 
        <component Cgroup="I2C" condition="MAX32672 CMSIS I2C" Cversion="1.6.0">
            <description>I2C Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2C/i2c_me21.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2C/i2c_reva.c" version="1.6.0"/>			   
            </files>
         </component>		 
		 
