vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32672.pdsc
        <component Cgroup="I2S" condition="MAX32672 CMSIS I2S" Cversion="1.6.0">
            <description>I2S Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2S/i2s_me21.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2S/i2s_reva.c" version="1.6.0"/>			   
            </files>
         </component>		 		 

         <component Cgroup="ICC" condition="MAX32672 CMSIS ICC" Cversion="1.6.0">
            <description>Instruction Cache Controller</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_me21.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_reva.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_common.c" version="1.6.0"/>			   
            </files>
         </component>		 
		 
         <component Cgroup="Low Power" condition="MAX32672 CMSIS Low Power" Cversion="1.6.0">
            <description>Low Power API</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/LP/lp_me21.c" version="1.6.0"/>			   
            </files>
         </component>		 

		  <component Cgroup="QDEC" condition="MAX32672 CMSIS QDEC" Cversion="1.6.0"> 
         	 <description>QDEC Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/QDEC/qdec_me21.c" version="1.6.0"/>
	           <file category="sourceC" name="Libraries/PeriphDrivers/Source/QDEC/qdec_reva.c" version="1.6.0"/>			   
            </files>
         </component>
		 
         <component Cgroup="RTC" condition="MAX32672 CMSIS RTC" Cversion="1.6.0">
            <description>Real-Time Clock</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/RTC/rtc_me21.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/RTC/rtc_reva.c" version="1.6.0"/>			   
            </files>
         </component>

         <component Cgroup="SPI" condition="MAX32672 CMSIS SPI" Cversion="1.6.0">
            <description>SPI Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPI/spi_me21.c" version="1.6.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPI/spi_reva.c" version="1.6.0"/>			   
            </files>
         </component>

         <component Cgroup="SYS" condition="MAX32672 CMSIS SYS" Cversion="1.6.0">
            <description>SYS Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/sys_me21.c" version="1.6.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_me21.c" version="1.6.0"/>
<!--               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_me13.c" version="1.6.0"/>	-->
<!--               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_es17.c" version="1.6.0"/> -->				   
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c" version="1.6.0"/>	
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_lock.c" version="1.6.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_delay.c" version="1.6.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_assert.c" version="1.6.0"/>

            </files>
         </component>

         <component Cgroup="Timers" condition="MAX32672 CMSIS TIMER" Cversion="1.6.0">
            <description>32-Bit Timers</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_me21.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_revb.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_common.c" version="1.6.0"/>			   
            </files>
         </component>

         <component Cgroup="TRNG" condition="MAX32672 CMSIS TRNG" Cversion="1.6.0">
            <description>TRNG</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/TRNG/trng_me21.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TRNG/trng_revb.c" version="1.6.0"/>		   
            </files>
         </component>

         <component Cgroup="UART" condition="MAX32672 CMSIS UART" Cversion="1.6.0">
            <description>UART Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_me21.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_revb.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_common.c" version="1.6.0"/>
            </files>
         </component>

      <component Cgroup="WDT" condition="MAX32672 CMSIS WDT" Cversion="1.6.0">
            <description>Watchdog Timers</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_me21.c" version="1.6.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_revb.c" version="1.6.0"/>
		<!--   <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_common.c" version="1.6.0"/> -->
            </files>
         </component>		    
      </bundle>
	  
      <bundle Cbundle="MAX32672 BSP" Cclass="BSP" Cversion="1.6.0">
         <description>MAX32672 Evaluation Kit Board Support Package</description>
         <doc>Doc/MAX32672_EvKit.txt</doc>
            <component Cgroup="EvKit V1" condition="MAX32672 BSP DEP">
		    <!-- <component Cgroup="EvKit V1"> -->
            <description>MAX32672 Evaluation Kit Board Setup</description>
            <RTE_Components_h>
               #define BOARD EvKit_V1 /* Target Board */			   
            </RTE_Components_h>
            <files>
			   <file category="include" name="Libraries/Boards/MAX32672/EvKit_V1/Include/" version="1.6.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32672/EvKit_V1/Source/board.c" version="1.6.0"/>	   			   
               <file category="include" name="Libraries/Boards/MAX32672/Include/" version="1.6.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32672/Source/led.c" version="1.6.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32672/Source/pb.c" version="1.6.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32672/Source/stdio.c" version="1.6.0"/>
           </files>
         </component>
      </bundle> 
   </components>
</package>